----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           1,728
       BatchNorm2d-2         [-1, 64, 112, 112]             128
             PReLU-3         [-1, 64, 112, 112]              64
       BatchNorm2d-4         [-1, 64, 112, 112]             128
            Conv2d-5         [-1, 64, 112, 112]          36,864
       BatchNorm2d-6         [-1, 64, 112, 112]             128
             PReLU-7         [-1, 64, 112, 112]              64
            Conv2d-8           [-1, 64, 56, 56]          36,864
       BatchNorm2d-9           [-1, 64, 56, 56]             128
           Conv2d-10           [-1, 64, 56, 56]           4,096
      BatchNorm2d-11           [-1, 64, 56, 56]             128
      IBasicBlock-12           [-1, 64, 56, 56]               0
      BatchNorm2d-13           [-1, 64, 56, 56]             128
           Conv2d-14           [-1, 64, 56, 56]          36,864
      BatchNorm2d-15           [-1, 64, 56, 56]             128
            PReLU-16           [-1, 64, 56, 56]              64
           Conv2d-17           [-1, 64, 56, 56]          36,864
      BatchNorm2d-18           [-1, 64, 56, 56]             128
      IBasicBlock-19           [-1, 64, 56, 56]               0
      BatchNorm2d-20           [-1, 64, 56, 56]             128
           Conv2d-21           [-1, 64, 56, 56]          36,864
      BatchNorm2d-22           [-1, 64, 56, 56]             128
            PReLU-23           [-1, 64, 56, 56]              64
           Conv2d-24           [-1, 64, 56, 56]          36,864
      BatchNorm2d-25           [-1, 64, 56, 56]             128
      IBasicBlock-26           [-1, 64, 56, 56]               0
      BatchNorm2d-27           [-1, 64, 56, 56]             128
           Conv2d-28          [-1, 128, 56, 56]          73,728
      BatchNorm2d-29          [-1, 128, 56, 56]             256
            PReLU-30          [-1, 128, 56, 56]             128
           Conv2d-31          [-1, 128, 28, 28]         147,456
      BatchNorm2d-32          [-1, 128, 28, 28]             256
           Conv2d-33          [-1, 128, 28, 28]           8,192
      BatchNorm2d-34          [-1, 128, 28, 28]             256
      IBasicBlock-35          [-1, 128, 28, 28]               0
      BatchNorm2d-36          [-1, 128, 28, 28]             256
           Conv2d-37          [-1, 128, 28, 28]         147,456
      BatchNorm2d-38          [-1, 128, 28, 28]             256
            PReLU-39          [-1, 128, 28, 28]             128
           Conv2d-40          [-1, 128, 28, 28]         147,456
      BatchNorm2d-41          [-1, 128, 28, 28]             256
      IBasicBlock-42          [-1, 128, 28, 28]               0
      BatchNorm2d-43          [-1, 128, 28, 28]             256
           Conv2d-44          [-1, 128, 28, 28]         147,456
      BatchNorm2d-45          [-1, 128, 28, 28]             256
            PReLU-46          [-1, 128, 28, 28]             128
           Conv2d-47          [-1, 128, 28, 28]         147,456
      BatchNorm2d-48          [-1, 128, 28, 28]             256
      IBasicBlock-49          [-1, 128, 28, 28]               0
      BatchNorm2d-50          [-1, 128, 28, 28]             256
           Conv2d-51          [-1, 128, 28, 28]         147,456
      BatchNorm2d-52          [-1, 128, 28, 28]             256
            PReLU-53          [-1, 128, 28, 28]             128
           Conv2d-54          [-1, 128, 28, 28]         147,456
      BatchNorm2d-55          [-1, 128, 28, 28]             256
      IBasicBlock-56          [-1, 128, 28, 28]               0
      BatchNorm2d-57          [-1, 128, 28, 28]             256
           Conv2d-58          [-1, 256, 28, 28]         294,912
      BatchNorm2d-59          [-1, 256, 28, 28]             512
            PReLU-60          [-1, 256, 28, 28]             256
           Conv2d-61          [-1, 256, 14, 14]         589,824
      BatchNorm2d-62          [-1, 256, 14, 14]             512
           Conv2d-63          [-1, 256, 14, 14]          32,768
      BatchNorm2d-64          [-1, 256, 14, 14]             512
      IBasicBlock-65          [-1, 256, 14, 14]               0
      BatchNorm2d-66          [-1, 256, 14, 14]             512
           Conv2d-67          [-1, 256, 14, 14]         589,824
      BatchNorm2d-68          [-1, 256, 14, 14]             512
            PReLU-69          [-1, 256, 14, 14]             256
           Conv2d-70          [-1, 256, 14, 14]         589,824
      BatchNorm2d-71          [-1, 256, 14, 14]             512
      IBasicBlock-72          [-1, 256, 14, 14]               0
      BatchNorm2d-73          [-1, 256, 14, 14]             512
           Conv2d-74          [-1, 256, 14, 14]         589,824
      BatchNorm2d-75          [-1, 256, 14, 14]             512
            PReLU-76          [-1, 256, 14, 14]             256
           Conv2d-77          [-1, 256, 14, 14]         589,824
      BatchNorm2d-78          [-1, 256, 14, 14]             512
      IBasicBlock-79          [-1, 256, 14, 14]               0
      BatchNorm2d-80          [-1, 256, 14, 14]             512
           Conv2d-81          [-1, 256, 14, 14]         589,824
      BatchNorm2d-82          [-1, 256, 14, 14]             512
            PReLU-83          [-1, 256, 14, 14]             256
           Conv2d-84          [-1, 256, 14, 14]         589,824
      BatchNorm2d-85          [-1, 256, 14, 14]             512
      IBasicBlock-86          [-1, 256, 14, 14]               0
      BatchNorm2d-87          [-1, 256, 14, 14]             512
           Conv2d-88          [-1, 256, 14, 14]         589,824
      BatchNorm2d-89          [-1, 256, 14, 14]             512
            PReLU-90          [-1, 256, 14, 14]             256
           Conv2d-91          [-1, 256, 14, 14]         589,824
      BatchNorm2d-92          [-1, 256, 14, 14]             512
      IBasicBlock-93          [-1, 256, 14, 14]               0
      BatchNorm2d-94          [-1, 256, 14, 14]             512
           Conv2d-95          [-1, 256, 14, 14]         589,824
      BatchNorm2d-96          [-1, 256, 14, 14]             512
            PReLU-97          [-1, 256, 14, 14]             256
           Conv2d-98          [-1, 256, 14, 14]         589,824
      BatchNorm2d-99          [-1, 256, 14, 14]             512
     IBasicBlock-100          [-1, 256, 14, 14]               0
     BatchNorm2d-101          [-1, 256, 14, 14]             512
          Conv2d-102          [-1, 256, 14, 14]         589,824
     BatchNorm2d-103          [-1, 256, 14, 14]             512
           PReLU-104          [-1, 256, 14, 14]             256
          Conv2d-105          [-1, 256, 14, 14]         589,824
     BatchNorm2d-106          [-1, 256, 14, 14]             512
     IBasicBlock-107          [-1, 256, 14, 14]               0
     BatchNorm2d-108          [-1, 256, 14, 14]             512
          Conv2d-109          [-1, 256, 14, 14]         589,824
     BatchNorm2d-110          [-1, 256, 14, 14]             512
           PReLU-111          [-1, 256, 14, 14]             256
          Conv2d-112          [-1, 256, 14, 14]         589,824
     BatchNorm2d-113          [-1, 256, 14, 14]             512
     IBasicBlock-114          [-1, 256, 14, 14]               0
     BatchNorm2d-115          [-1, 256, 14, 14]             512
          Conv2d-116          [-1, 256, 14, 14]         589,824
     BatchNorm2d-117          [-1, 256, 14, 14]             512
           PReLU-118          [-1, 256, 14, 14]             256
          Conv2d-119          [-1, 256, 14, 14]         589,824
     BatchNorm2d-120          [-1, 256, 14, 14]             512
     IBasicBlock-121          [-1, 256, 14, 14]               0
     BatchNorm2d-122          [-1, 256, 14, 14]             512
          Conv2d-123          [-1, 256, 14, 14]         589,824
     BatchNorm2d-124          [-1, 256, 14, 14]             512
           PReLU-125          [-1, 256, 14, 14]             256
          Conv2d-126          [-1, 256, 14, 14]         589,824
     BatchNorm2d-127          [-1, 256, 14, 14]             512
     IBasicBlock-128          [-1, 256, 14, 14]               0
     BatchNorm2d-129          [-1, 256, 14, 14]             512
          Conv2d-130          [-1, 256, 14, 14]         589,824
     BatchNorm2d-131          [-1, 256, 14, 14]             512
           PReLU-132          [-1, 256, 14, 14]             256
          Conv2d-133          [-1, 256, 14, 14]         589,824
     BatchNorm2d-134          [-1, 256, 14, 14]             512
     IBasicBlock-135          [-1, 256, 14, 14]               0
     BatchNorm2d-136          [-1, 256, 14, 14]             512
          Conv2d-137          [-1, 256, 14, 14]         589,824
     BatchNorm2d-138          [-1, 256, 14, 14]             512
           PReLU-139          [-1, 256, 14, 14]             256
          Conv2d-140          [-1, 256, 14, 14]         589,824
     BatchNorm2d-141          [-1, 256, 14, 14]             512
     IBasicBlock-142          [-1, 256, 14, 14]               0
     BatchNorm2d-143          [-1, 256, 14, 14]             512
          Conv2d-144          [-1, 256, 14, 14]         589,824
     BatchNorm2d-145          [-1, 256, 14, 14]             512
           PReLU-146          [-1, 256, 14, 14]             256
          Conv2d-147          [-1, 256, 14, 14]         589,824
     BatchNorm2d-148          [-1, 256, 14, 14]             512
     IBasicBlock-149          [-1, 256, 14, 14]               0
     BatchNorm2d-150          [-1, 256, 14, 14]             512
          Conv2d-151          [-1, 256, 14, 14]         589,824
     BatchNorm2d-152          [-1, 256, 14, 14]             512
           PReLU-153          [-1, 256, 14, 14]             256
          Conv2d-154          [-1, 256, 14, 14]         589,824
     BatchNorm2d-155          [-1, 256, 14, 14]             512
     IBasicBlock-156          [-1, 256, 14, 14]               0
     BatchNorm2d-157          [-1, 256, 14, 14]             512
          Conv2d-158          [-1, 512, 14, 14]       1,179,648
     BatchNorm2d-159          [-1, 512, 14, 14]           1,024
           PReLU-160          [-1, 512, 14, 14]             512
          Conv2d-161            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-162            [-1, 512, 7, 7]           1,024
          Conv2d-163            [-1, 512, 7, 7]         131,072
     BatchNorm2d-164            [-1, 512, 7, 7]           1,024
     IBasicBlock-165            [-1, 512, 7, 7]               0
     BatchNorm2d-166            [-1, 512, 7, 7]           1,024
          Conv2d-167            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-168            [-1, 512, 7, 7]           1,024
           PReLU-169            [-1, 512, 7, 7]             512
          Conv2d-170            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-171            [-1, 512, 7, 7]           1,024
     IBasicBlock-172            [-1, 512, 7, 7]               0
     BatchNorm2d-173            [-1, 512, 7, 7]           1,024
          Conv2d-174            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-175            [-1, 512, 7, 7]           1,024
           PReLU-176            [-1, 512, 7, 7]             512
          Conv2d-177            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-178            [-1, 512, 7, 7]           1,024
     IBasicBlock-179            [-1, 512, 7, 7]               0
     BatchNorm2d-180            [-1, 512, 7, 7]           1,024
         Dropout-181                [-1, 25088]               0
          Linear-182                 [-1, 2048]      51,382,272
     BatchNorm1d-183                 [-1, 2048]           4,096
         IResNet-184                 [-1, 2048]               0
            ReLU-185                 [-1, 2048]               0
         Encoder-186                 [-1, 2048]               0
          Linear-187                    [-1, 2]           1,026
      Classifier-188                    [-1, 2]               0
          Linear-189                    [-1, 4]           2,052
      Classifier-190                    [-1, 4]               0
          Linear-191                    [-1, 5]           2,565
      Classifier-192                    [-1, 5]               0
          Linear-193                  [-1, 100]          51,300
      Classifier-194                  [-1, 100]               0
          Linear-195                    [-1, 1]           2,049
      Classifier-196                    [-1, 1]               0
          Linear-197                    [-1, 1]           2,049
      Classifier-198                    [-1, 1]               0
================================================================
Total params: 82,191,665
Trainable params: 82,187,569
Non-trainable params: 4,096
----------------------------------------------------------------
Input size (MB): 0.14
Forward/backward pass size (MB): 151.48
Params size (MB): 313.54
Estimated Total Size (MB): 465.16
----------------------------------------------------------------
